In [1]:
import numpy as np
import pandas as pd

In [2]:
## read the excel file
pd.read_excel("excel.xlsx")

  Unnamed: 0  Yas   Maas     Meslek
0        Ali   30  100.0    yazilim
1       Veli   40  100.0     avukat
2      Semih   32  200.0    yazilim
3   Ertugrul   60  125.0        NaN
4      Merve   23   75.0  isletmeci
5      Zuhre   20    NaN    firinci

In [3]:
df = pd.read_excel("excel.xlsx")
df

  Unnamed: 0  Yas   Maas     Meslek
0        Ali   30  100.0    yazilim
1       Veli   40  100.0     avukat
2      Semih   32  200.0    yazilim
3   Ertugrul   60  125.0        NaN
4      Merve   23   75.0  isletmeci
5      Zuhre   20    NaN    firinci

In [5]:
updatedDf = df.dropna()
updatedDf

  Unnamed: 0  Yas   Maas     Meslek
0        Ali   30  100.0    yazilim
1       Veli   40  100.0     avukat
2      Semih   32  200.0    yazilim
4      Merve   23   75.0  isletmeci

In [8]:
updatedDf.to_excel("Updated Excel File.xlsx")